app/views/sessions/new.html.erb

SELECT "jedis".* FROM "jedis"
---

    <%= collection_select(:jedi, :name, Jedi.all, :name, :name, prompt: "Please select your Jedi name from this dropdown") %>