app/views/users/show.html.erb


    <%= collection_select(:jedi, :id, current_user.jedis.all, :id, :name, prompt: "Please select your Jedi name from this dropdown or create a new Jedi below") %>
---
SELECT "jedis".* FROM "jedis" WHERE "jedis"."user_id" = ?  [["user_id", 1]]