app/controllers/application_controller.rb

  def current_jedi
    Jedi.find_by(id:session[:jedi_id])
---
SELECT  "jedis".* FROM "jedis" WHERE "jedis"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]