app/controllers/fights_controller.rb

INSERT INTO "fights" ("jedi_id", "sith_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["jedi_id", 1], ["sith_id", 2], ["created_at", "2018-04-20 03:37:27.877292"], ["updated_at", "2018-04-20 03:37:27.877292"]]
---
  def create
    fight = Fight.create(fight_params)