app/controllers/jedis_controller.rb

  def create
    if (jedi = Jedi.create jedi_params)
---
INSERT INTO "jedis" ("name", "strength", "hp", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def show
    @jedi = Jedi.find_by(id:params[:id])
---
SELECT  "jedis".* FROM "jedis" WHERE "jedis"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]