app/controllers/session_controller.rb

  def create
    if @jedi = Jedi.find_by(name:params[:jedi][:name])
---
SELECT  "jedis".* FROM "jedis" WHERE "jedis"."name" = ? LIMIT ?  [["name", "obi"], ["LIMIT", 1]]