app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "test"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "image", "password_digest", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "10107447469932452"], ["LIMIT", 1]]
---
  def create
    if params[:name]
      @user = User.find_by(:name => params[:name])
    else
      @user = User.find_or_create_by(uid: auth['uid']) do |u|