app/controllers/siths_controller.rb

  def index
    @siths = Sith.all
---
SELECT "siths".* FROM "siths"

  def show
    @sith = Sith.find_by(id: params[:id])
---
SELECT  "siths".* FROM "siths" WHERE "siths"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    sith = Sith.create(sith_params)
---
INSERT INTO "siths" ("name", "power", "health", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Darth Maul"], ["power", 6], ["health", 3], ["created_at", "2018-04-20 03:25:51.296164"], ["updated_at", "2018-04-20 03:25:51.296164"]]