app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Josh"], ["password_digest", "$2a$10$E1rDfLXUczF6uPtNRw2RyupoCUzNz7IrDBAnYQQPVf.bA//Ho8gkG"], ["created_at", "2018-04-24 03:39:01.155115"], ["updated_at", "2018-04-24 03:39:01.155115"]]