app/models/fight.rb

  def start_fight
    new_hp = self.jedi.hp - self.sith.power
    new_strength = self.jedi.strength + self.sith.health
    self.jedi.update{
---
UPDATE "jedis" SET "hp" = ?, "strength" = ?, "updated_at" = ? WHERE "jedis"."id" = ?  [["hp", 4], ["strength", 8], ["updated_at", "2018-04-20 03:37:27.889917"], ["id", 1]]